In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame
import os

In [9]:
data1=pd.read_csv('D:\Python\Jigsaw\Data Manipulation with Pandas\Practice3\Sales_Oct.csv',sep=',',header=0,encoding="latin")
print(data1.head())
print(data2.shape)

  Cust_ID  Sales_Amount
0     CS1          1000
1     CS2           890
2     CS3           900
3     CS4           450
4     CS8           980
(10, 2)

In [10]:
data2=pd.read_csv('D:\Python\Jigsaw\Data Manipulation with Pandas\Practice3\Sales_Sep.csv',sep=',',header=0, encoding="latin")
print(data2.head())
print(data2.shape)

  Cust_ID  Sales_Amount
0     CS1          1000
1     CS2           900
2     CS3           875
3     CS4           230
4     CS5           987
(10, 2)

In [12]:
# Concatenate
row_concat = pd.concat([data1, data2])

In [14]:
# Print the shape of row_concat
print(row_concat.shape)

(22, 2)

In [16]:
# Print the head of row_concat
print(row_concat.head())

  Cust_ID  Sales_Amount
0     CS1          1000
1     CS2           890
2     CS3           900
3     CS4           450
4     CS8           980

In [18]:
from pandas import DataFrame

In [22]:
## Merging DataFrames
df1=DataFrame({'CustomerID':[1,2,3,4,5,6],'Product':['Television','Television','Television','Earphones','Earphones','Earphones']})
df2=DataFrame({'CustomerID':[2,4,6],'State':['Texas','Texas','Seattle']})

In [24]:
print(df1)

   CustomerID     Product
0           1  Television
1           2  Television
2           3  Television
3           4   Earphones
4           5   Earphones
5           6   Earphones

In [26]:
print(df2)

   CustomerID    State
0           2    Texas
1           4    Texas
2           6  Seattle

In [28]:
pd.merge(df1,df2,how='outer',on='CustomerID')

   CustomerID     Product    State
0           1  Television      NaN
1           2  Television    Texas
2           3  Television      NaN
3           4   Earphones    Texas
4           5   Earphones      NaN
5           6   Earphones  Seattle

In [30]:
pd.merge(df1,df2,how='inner',on='CustomerID')

   CustomerID     Product    State
0           2  Television    Texas
1           4   Earphones    Texas
2           6   Earphones  Seattle

In [32]:
pd.merge(df1,df2,how='right',on='CustomerID')

   CustomerID     Product    State
0           2  Television    Texas
1           4   Earphones    Texas
2           6   Earphones  Seattle

In [34]:
pd.merge(df1,df2,how='left',on='CustomerID')

   CustomerID     Product    State
0           1  Television      NaN
1           2  Television    Texas
2           3  Television      NaN
3           4   Earphones    Texas
4           5   Earphones      NaN
5           6   Earphones  Seattle

In [36]:
df1

   CustomerID     Product
0           1  Television
1           2  Television
2           3  Television
3           4   Earphones
4           5   Earphones
5           6   Earphones

In [38]:
# while joining if CustomerID and Customerid is writtern then we need to be carefull to check as it os the key factor
# folllowing way we can add

#pd.merge(df1,df2,how='inner',left_on='CustomerId',right_on='CustomerID')
#pd.merge(df1,df2,how='inner',left_on='CustomerId',right_on='CustomerID').drop('CustomerID',axis=1)